ГТС/УТГТС/AccumulationRegisters/РезервыТоваровОрганизаций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>РезервыТоваровОрганизаций</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоПоРНПТ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>23</v8:Digits>
							<v8:FractionDigits>11</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>КорОрганизация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КорВидЗапасов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыЗапасов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>АналитикаУчетаНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлючиАналитикиУчетаНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидЗапасов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыЗапасов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НомерГТД</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НомераГТД</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЭтоСторно</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

ГТС/УТГТС/Enums/ТипыЗапасов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ТипыЗапасов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Товар</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КомиссионныйТовар</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МатериалДавальца</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПолуфабрикатДавальца</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПродукцияДавальца</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТоварНаХраненииСПравомПродажи</Name>
					<Comment>Товар, принятый на ответственное хранение с целью дальнейшей продажи</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТоварНаХраненииСПравомПродажиПереданный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СобственныйТоварВПути</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СобственныйТоварПоНеотфактурованнойПоставке</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПродукцияПереработчика</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Услуга</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АгентскаяУслуга</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Работа</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

ГТС/УТГТС/Enums/ТипыНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ТипыНоменклатуры</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Товар</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МногооборотнаяТара</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Услуга</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Работа</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Набор</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

ГТС/УТГТС/Catalogs/СтруктураПредприятия.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>СтруктураПредприятия</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyOfItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ТекущийРуководитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВариантОбособленногоУчетаТоваров</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВариантыОбособленногоУчетаТоваров</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Баннер</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Источник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СоответствуетСтруктуреЮридическихЛиц</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроизводственноеПодразделение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГрафикРаботы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Календари</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИнтервалПланирования</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачалоИнтервалаПланирования</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОкончаниеИнтервалаПланирования</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УправлениеМаршрутнымиЛистами</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РеквизитДопУпорядочивания</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаполнениеДоступностиДляРасписанияРЦКоличествоИнтервалов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаполнениеДоступностиДляРасписанияРЦНапоминаниеДней</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаполнениеДоступностиДляГрафикаПроизводстваКоличествоИнтервалов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособПооперационногоУправления</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаполнениеДоступностиДляГрафикаПроизводстваНапоминаниеДней</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодразделениеДиспетчер</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьСерииНоменклатуры</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВремяНаРегистрациюВыполнения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВремяНаРегистрациюВыполненияЕдИзм</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЕдиницыИзмеренияВремени</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УчитыватьСебестоимостьПоСериям</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроизводствоПоЗаказам</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроизводствоБезЗаказов</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользуетсяСписаниеЗатратНаВыпуск</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособПолученияПолуфабрикатов</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьПооперационноеУправление</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьМатериалыВОперациях</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьВыходныеИзделияВОперациях</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьПооперационноеПланирование</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодичностьОформленияВыработки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьКТУ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьТарифныеСтавки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьОтработанноеВремя</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьБригадныеНаряды</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьПерсональныеНаряды</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособНастройкиГрафикаРаботы</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыНастройкиГрафикаРаботыПодразделений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьСменныеЗадания</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьПроизводственныеУчастки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодИсточника</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>9</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыОрганизацийПодразделений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоэффициентРастяженияГрафикаПроизводства</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ГрафикиРаботы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ГрафикРаботы</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Календари</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

ГТС/УТГТС/AccumulationRegisters/РезервыТоваровОрганизаций/Ext/RecordSetModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, Замещение)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	БлокироватьДляИзменения = Истина;
	
	
	Если Не ПроведениеДокументов.КонтролироватьИзменения(ДополнительныеСвойства) Тогда
		ДополнительныеСвойства.Вставить("МенеджерВременныхТаблиц", Новый МенеджерВременныхТаблиц);
	КонецЕсли;
	
	ЗапасыСервер.СохранитьИсходныеДвиженияТоваровИРезервов(Отбор.Регистратор.Значение,
		ДополнительныеСвойства.МенеджерВременныхТаблиц);
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ, Замещение)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	ТаблицаПриЗаписи.Период КАК Период,
	|	ТаблицаПриЗаписи.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
	|	ТаблицаПриЗаписи.АналитикаУчетаНоменклатуры.Номенклатура.ТипНоменклатуры КАК ТипНоменклатуры,
	|	ТаблицаПриЗаписи.АналитикаУчетаНоменклатуры.МестоХранения КАК Склад,
	|	ТаблицаПриЗаписи.Организация КАК Организация,
	|	ТаблицаПриЗаписи.КорОрганизация,
	|	ТаблицаПриЗаписи.ВидЗапасов КАК ВидЗапасов,
	|	ТаблицаПриЗаписи.КорВидЗапасов КАК КорВидЗапасов,
	|	ТаблицаПриЗаписи.ВидЗапасов.ТипЗапасов КАК ТипЗапасов,
	|	ТаблицаПриЗаписи.КорВидЗапасов.ТипЗапасов КАК ТипЗапасовКорВидаЗапасов,
	|	ТаблицаПриЗаписи.ВидЗапасов.Организация КАК ОрганизацияВидаЗапасов,
	|	ТаблицаПриЗаписи.НомерГТД КАК НомерГТД,
	|	ТаблицаПриЗаписи.Количество,
	|	ТаблицаПриЗаписи.ВидДвижения КАК ВидДвижения,
	|	ИСТИНА КАК ЭтоНовоеДвижение
	|ПОМЕСТИТЬ АналитикаРезервыТоваровОрганизаций
	|ИЗ
	|	РегистрНакопления.РезервыТоваровОрганизаций КАК ТаблицаПриЗаписи
	|ГДЕ
	|	ТаблицаПриЗаписи.Регистратор = &Регистратор";
	
	Если ПроведениеДокументов.КонтролироватьИзменения(ДополнительныеСвойства) Тогда
		Запрос.МенеджерВременныхТаблиц = ДополнительныеСвойства.МенеджерВременныхТаблиц;
		ТекстЗапроса = ТекстЗапроса + "
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ТаблицаПередЗаписью.Период,
		|	ТаблицаПередЗаписью.АналитикаУчетаНоменклатуры,
		|	ТаблицаПередЗаписью.АналитикаУчетаНоменклатуры.Номенклатура.ТипНоменклатуры,
		|	ТаблицаПередЗаписью.АналитикаУчетаНоменклатуры.МестоХранения,
		|	ТаблицаПередЗаписью.Организация,
		|	ТаблицаПередЗаписью.КорОрганизация,
		|	ТаблицаПередЗаписью.ВидЗапасов,
		|	ТаблицаПередЗаписью.КорВидЗапасов,
		|	ТаблицаПередЗаписью.ВидЗапасов.ТипЗапасов,
		|	ТаблицаПередЗаписью.КорВидЗапасов.ТипЗапасов,
		|	ТаблицаПередЗаписью.ВидЗапасов.Организация,
		|	ТаблицаПередЗаписью.НомерГТД,
		|	ТаблицаПередЗаписью.Количество,
		|	ТаблицаПередЗаписью.ВидДвижения,
		|	ЛОЖЬ
		|ИЗ
		|	ДвиженияРезервыТоварыОрганизацийПередЗаписью КАК ТаблицаПередЗаписью
		|";
	КонецЕсли;
	
	ТекстЗапроса = ТекстЗапроса + 
	"
	|ИНДЕКСИРОВАТЬ ПО
	|	АналитикаУчетаНоменклатуры,
	|	Организация,
	|	ВидЗапасов,
	|	НомерГТД
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|";
	
	ТекстЗапроса = ТекстЗапроса +
	"ВЫБРАТЬ
	|	МАКСИМУМ(ВложенныйЗапрос.Период) КАК Период,
	|	NULL КАК ВидДвижения,
	|	ВложенныйЗапрос.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
	|	ВложенныйЗапрос.Организация КАК Организация,
	|	ВложенныйЗапрос.ВидЗапасов КАК ВидЗапасов,
	|	ВложенныйЗапрос.НомерГТД КАК НомерГТД,
	|	""ОшибкаБаланса"" КАК ТипОшибки
	|ИЗ
	|	(ВЫБРАТЬ
	|		РезервыТоваровОрганизаций.Период КАК Период,
	|		РезервыТоваровОрганизаций.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
	|		РезервыТоваровОрганизаций.Организация КАК Организация,
	|		РезервыТоваровОрганизаций.ВидЗапасов КАК ВидЗапасов,
	|		РезервыТоваровОрганизаций.НомерГТД КАК НомерГТД,
	|		РезервыТоваровОрганизаций.Количество КАК Количество
	|	ИЗ
	|		АналитикаРезервыТоваровОрганизаций КАК РезервыТоваровОрганизаций
	|	ГДЕ
	|		РезервыТоваровОрганизаций.ЭтоНовоеДвижение
	|		И РезервыТоваровОрганизаций.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		РезервыТоваровОрганизаций.Период,
	|		РезервыТоваровОрганизаций.АналитикаУчетаНоменклатуры,
	|		РезервыТоваровОрганизаций.КорОрганизация,
	|		РезервыТоваровОрганизаций.КорВидЗапасов,
	|		РезервыТоваровОрганизаций.НомерГТД,
	|		-РезервыТоваровОрганизаций.Количество
	|	ИЗ
	|		АналитикаРезервыТоваровОрганизаций КАК РезервыТоваровОрганизаций
	|	ГДЕ
	|		РезервыТоваровОрганизаций.ЭтоНовоеДвижение
	|		И РезервыТоваровОрганизаций.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		РезервыТоваровОрганизаций.Период,
	|		РезервыТоваровОрганизаций.АналитикаУчетаНоменклатуры,
	|		РезервыТоваровОрганизаций.Организация,
	|		РезервыТоваровОрганизаций.ВидЗапасов,
	|		РезервыТоваровОрганизаций.НомерГТД,
	|		РезервыТоваровОрганизаций.Количество
	|	ИЗ
	|		АналитикаРезервыТоваровОрганизаций КАК РезервыТоваровОрганизаций
	|	ГДЕ
	|		РезервыТоваровОрганизаций.ЭтоНовоеДвижение
	|		И РезервыТоваровОрганизаций.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		РезервыТоваровОрганизаций.Период,
	|		РезервыТоваровОрганизаций.АналитикаУчетаНоменклатуры,
	|		РезервыТоваровОрганизаций.КорОрганизация,
	|		РезервыТоваровОрганизаций.КорВидЗапасов,
	|		РезервыТоваровОрганизаций.НомерГТД,
	|		-РезервыТоваровОрганизаций.Количество
	|	ИЗ
	|		АналитикаРезервыТоваровОрганизаций КАК РезервыТоваровОрганизаций
	|	ГДЕ
	|		РезервыТоваровОрганизаций.ЭтоНовоеДвижение
	|		И РезервыТоваровОрганизаций.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)) КАК ВложенныйЗапрос
	|
	|СГРУППИРОВАТЬ ПО
	|	ВложенныйЗапрос.НомерГТД,
	|	ВложенныйЗапрос.ВидЗапасов,
	|	ВложенныйЗапрос.Организация,
	|	ВложенныйЗапрос.АналитикаУчетаНоменклатуры
	|
	|ИМЕЮЩИЕ
	|	СУММА(ВложенныйЗапрос.Количество) <> 0
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	НАЧАЛОПЕРИОДА(РезервыТоваровОрганизаций.Период, МЕСЯЦ),
	|	РезервыТоваровОрганизаций.ВидДвижения,
	|	РезервыТоваровОрганизаций.АналитикаУчетаНоменклатуры,
	|	РезервыТоваровОрганизаций.Организация,
	|	РезервыТоваровОрганизаций.ВидЗапасов,
	|	РезервыТоваровОрганизаций.НомерГТД,
	|	""ОшибкаНулевоеКоличество""
	|ИЗ
	|	АналитикаРезервыТоваровОрганизаций КАК РезервыТоваровОрганизаций
	|ГДЕ
	|	РезервыТоваровОрганизаций.ЭтоНовоеДвижение
	|
	|СГРУППИРОВАТЬ ПО
	|	НАЧАЛОПЕРИОДА(РезервыТоваровОрганизаций.Период, МЕСЯЦ),
	|	РезервыТоваровОрганизаций.НомерГТД,
	|	РезервыТоваровОрганизаций.ВидЗапасов,
	|	РезервыТоваровОрганизаций.Организация,
	|	РезервыТоваровОрганизаций.АналитикаУчетаНоменклатуры,
	|	РезервыТоваровОрганизаций.КорОрганизация,
	|	РезервыТоваровОрганизаций.КорВидЗапасов,
	|	РезервыТоваровОрганизаций.ВидДвижения
	|
	|ИМЕЮЩИЕ
	|	СУММА(ВЫБОР
	|			КОГДА РезервыТоваровОрганизаций.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|				ТОГДА РезервыТоваровОрганизаций.Количество
	|			ИНАЧЕ -РезервыТоваровОрганизаций.Количество
	|		КОНЕЦ) = 0
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	РезервыТоваровОрганизаций.Период,
	|	NULL,
	|	РезервыТоваровОрганизаций.АналитикаУчетаНоменклатуры,
	|	РезервыТоваровОрганизаций.Организация,
	|	РезервыТоваровОрганизаций.ВидЗапасов,
	|	РезервыТоваровОрганизаций.НомерГТД,
	|	""ОшибкаПринадлежностиВидовЗапасов""
	|ИЗ
	|	АналитикаРезервыТоваровОрганизаций КАК РезервыТоваровОрганизаций
	|ГДЕ
	|	РезервыТоваровОрганизаций.ЭтоНовоеДвижение
	|	И РезервыТоваровОрганизаций.Организация <> РезервыТоваровОрганизаций.ОрганизацияВидаЗапасов
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	РезервыТоваровОрганизаций.Период,
	|	NULL,
	|	РезервыТоваровОрганизаций.АналитикаУчетаНоменклатуры,
	|	РезервыТоваровОрганизаций.Организация,
	|	РезервыТоваровОрганизаций.ВидЗапасов,
	|	РезервыТоваровОрганизаций.НомерГТД,
	|	""ОшибкаПодобранногоВидаЗапасов""
	|ИЗ
	|	АналитикаРезервыТоваровОрганизаций КАК РезервыТоваровОрганизаций
	|ГДЕ
	|	РезервыТоваровОрганизаций.ЭтоНовоеДвижение
	|	И РезервыТоваровОрганизаций.Организация = РезервыТоваровОрганизаций.КорОрганизация
	|	И РезервыТоваровОрганизаций.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|	И НЕ РезервыТоваровОрганизаций.ТипЗапасовКорВидаЗапасов В (
	|									ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.ТоварНаХраненииСПравомПродажи))
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	РезервыТоваровОрганизаций.Период,
	|	NULL,
	|	РезервыТоваровОрганизаций.АналитикаУчетаНоменклатуры,
	|	РезервыТоваровОрганизаций.Организация,
	|	РезервыТоваровОрганизаций.ВидЗапасов,
	|	РезервыТоваровОрганизаций.НомерГТД,
	|	""ОшибкаПриходРезерваПоТоварНаХраненииСПравомПродажи""
	|ИЗ
	|	АналитикаРезервыТоваровОрганизаций КАК РезервыТоваровОрганизаций
	|ГДЕ
	|	РезервыТоваровОрганизаций.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|	И РезервыТоваровОрганизаций.ТипЗапасов = ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.ТоварНаХраненииСПравомПродажи)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	РезервыТоваровОрганизаций.Период,
	|	NULL,
	|	РезервыТоваровОрганизаций.АналитикаУчетаНоменклатуры,
	|	РезервыТоваровОрганизаций.Организация,
	|	РезервыТоваровОрганизаций.ВидЗапасов,
	|	РезервыТоваровОрганизаций.НомерГТД,
	|	""ОшибкаТипаНоменклатуры""
	|ИЗ
	|	АналитикаРезервыТоваровОрганизаций КАК РезервыТоваровОрганизаций
	|ГДЕ
	|	РезервыТоваровОрганизаций.ЭтоНовоеДвижение
	|	И РезервыТоваровОрганизаций.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|	И НЕ РезервыТоваровОрганизаций.ТипНоменклатуры В (ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Товар), ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.МногооборотнаяТара))
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КОНЕЦПЕРИОДА(АналитикаРезервыТоваровОрганизаций.Период, МЕСЯЦ) КАК Период,
	|	АналитикаРезервыТоваровОрганизаций.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
	|	АналитикаРезервыТоваровОрганизаций.Организация КАК Организация,
	|	АналитикаРезервыТоваровОрганизаций.ВидЗапасов КАК ВидЗапасов,
	|	АналитикаРезервыТоваровОрганизаций.НомерГТД КАК НомерГТД
	|ПОМЕСТИТЬ ДвиженияРезервыТоваровОрганизацийИзменение
	|ИЗ
	|	АналитикаРезервыТоваровОрганизаций КАК АналитикаРезервыТоваровОрганизаций
	|ГДЕ
	|	НЕ АналитикаРезервыТоваровОрганизаций.Склад ССЫЛКА Справочник.СтруктураПредприятия
	|	И НЕ &НеПроверятьЛишнееСторно
	|
	|СГРУППИРОВАТЬ ПО
	|	КОНЕЦПЕРИОДА(АналитикаРезервыТоваровОрганизаций.Период, МЕСЯЦ),
	|	АналитикаРезервыТоваровОрганизаций.АналитикаУчетаНоменклатуры,
	|	АналитикаРезервыТоваровОрганизаций.Организация,
	|	АналитикаРезервыТоваровОрганизаций.ВидЗапасов,
	|	АналитикаРезервыТоваровОрганизаций.НомерГТД
	|
	|ИМЕЮЩИЕ
	// Проверяем только уменьшение остатка
	|	СУММА(ВЫБОР
	|			КОГДА АналитикаРезервыТоваровОрганизаций.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|						И АналитикаРезервыТоваровОрганизаций.ЭтоНовоеДвижение
	|					ИЛИ АналитикаРезервыТоваровОрганизаций.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|						И НЕ АналитикаРезервыТоваровОрганизаций.ЭтоНовоеДвижение
	|				ТОГДА -АналитикаРезервыТоваровОрганизаций.Количество
	|			ИНАЧЕ АналитикаРезервыТоваровОрганизаций.Количество
	|		КОНЕЦ) < 0
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	АналитикаРезервыТоваровОрганизаций.АналитикаУчетаНоменклатуры,
	|	АналитикаРезервыТоваровОрганизаций.Организация,
	|	АналитикаРезервыТоваровОрганизаций.ВидЗапасов,
	|	АналитикаРезервыТоваровОрганизаций.НомерГТД
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МИНИМУМ(ДвиженияРезервыТоваровОрганизацийИзменение.Период) КАК Период
	|ИЗ
	|	ДвиженияРезервыТоваровОрганизацийИзменение КАК ДвиженияРезервыТоваровОрганизацийИзменение
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РезервыТоваров.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
	|	РезервыТоваров.Организация КАК Организация,
	|	РезервыТоваров.ВидЗапасов КАК ВидЗапасов,
	|	РезервыТоваров.НомерГТД КАК НомерГТД,
	|	КОНЕЦПЕРИОДА(РезервыТоваров.Период, МЕСЯЦ) КАК Период,
	|	СУММА(РезервыТоваров.Количество) КАК Количество
	|ИЗ
	|	РегистрНакопления.РезервыТоваровОрганизаций КАК РезервыТоваров
	|ГДЕ
	|	(РезервыТоваров.АналитикаУчетаНоменклатуры, РезервыТоваров.Организация, РезервыТоваров.ВидЗапасов, РезервыТоваров.НомерГТД) В
	|			(ВЫБРАТЬ
	|				ТаблицаАналитик.АналитикаУчетаНоменклатуры,
	|				ТаблицаАналитик.Организация,
	|				ТаблицаАналитик.ВидЗапасов,
	|				ТаблицаАналитик.НомерГТД
	|			ИЗ
	|				ДвиженияРезервыТоваровОрганизацийИзменение КАК ТаблицаАналитик)
	|
	|СГРУППИРОВАТЬ ПО
	|	КОНЕЦПЕРИОДА(РезервыТоваров.Период, МЕСЯЦ),
	|	РезервыТоваров.ВидДвижения,
	|	РезервыТоваров.НомерГТД,
	|	РезервыТоваров.ВидЗапасов,
	|	РезервыТоваров.Организация,
	|	РезервыТоваров.АналитикаУчетаНоменклатуры
	|
	|ИМЕЮЩИЕ
	|	СУММА(РезервыТоваров.Количество) <> 0
	|
	|УПОРЯДОЧИТЬ ПО
	|	АналитикаУчетаНоменклатуры,
	|	Организация,
	|	ВидЗапасов,
	|	НомерГТД,
	|	Период
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ АналитикаРезервыТоваровОрганизаций";
	
	Запрос.Текст = ТекстЗапроса;
	Запрос.УстановитьПараметр("Регистратор", Отбор.Регистратор.Значение);
	Запрос.УстановитьПараметр("КонтролироватьОстатки", Константы.КонтролироватьОстаткиТоваровОрганизаций.Получить());
	Запрос.УстановитьПараметр("РассчитыватьИзменения", ПроведениеДокументов.РассчитыватьИзменения(ДополнительныеСвойства));
	Запрос.УстановитьПараметр("НеПроверятьЛишнееСторно", ДополнительныеСвойства.Свойство("НеПроверятьЛишнееСторно"));
	
	Результат = Запрос.ВыполнитьПакет();  
	ВыборкаОшибок = Результат[1].Выбрать();
	
	МассивТекстовИсключений = Новый Массив;
	
	Пока ВыборкаОшибок.Следующий() Цикл
		
		Если ВыборкаОшибок.ТипОшибки = "ОшибкаБаланса" Тогда
			ТекстИсключения = НСтр("ru = 'Ошибка в алгоритмах при записи %Регистратор% в регистр %Регистр%: нарушен баланс по измерениям %АналитикаНоменклатуры%-%Организация%-%ВидЗапасов%-%НомерГТД%. Обратитесь к разработчикам программы.'");
		ИначеЕсли ВыборкаОшибок.ТипОшибки = "ОшибкаНулевоеКоличество" Тогда
			ТекстИсключения = НСтр("ru = 'Ошибка в алгоритмах при записи %Регистратор% в регистр %Регистр%: в месяце %Месяц% записывается нулевое количество по измерениям: %АналитикаНоменклатуры%-%Организация%-%ВидЗапасов%-%НомерГТД%. Обратитесь к разработчикам программы.'");
		ИначеЕсли ВыборкаОшибок.ТипОшибки = "ОшибкаПринадлежностиВидовЗапасов" Тогда
			ТекстИсключения = НСтр("ru = 'Ошибка в алгоритмах при записи %Регистратор% в регистр %Регистр%: по измерениям записывается вид запасов, не принадлежащий организации %АналитикаНоменклатуры%-%Организация%-%ВидЗапасов%-%НомерГТД%. Обратитесь к разработчикам программы.'");
		ИначеЕсли ВыборкаОшибок.ТипОшибки = "ОшибкаПодобранногоВидаЗапасов" Тогда
			ТекстИсключения = НСтр("ru = 'Ошибка в алгоритмах при записи %Регистратор% в регистр %Регистр%: организация и кор. организация совпадают, но при этом тип запасов вида запасов не %ТипЗапасов% %АналитикаНоменклатуры%-%Организация%-%ВидЗапасов%-%НомерГТД%. Обратитесь к разработчикам программы.'");
		ИначеЕсли ВыборкаОшибок.ТипОшибки = "ОшибкаПриходРезерваПоТоварНаХраненииСПравомПродажи" Тогда
			ТекстИсключения = НСтр("ru = 'Ошибка в алгоритмах при записи %Регистратор% в регистр %Регистр%: приход резерва по типу запасов %ТипЗапасов% %АналитикаНоменклатуры%-%Организация%-%ВидЗапасов%-%НомерГТД%. Обратитесь к разработчикам программы.'");
		ИначеЕсли ВыборкаОшибок.ТипОшибки = "ОшибкаТипаНоменклатуры" Тогда
			ТекстИсключения = НСтр("ru = 'Ошибка в алгоритмах при записи %Регистратор% в регистр %Регистр%: пишется резерв не по товару или многооборотной таре по измерениям %АналитикаНоменклатуры%-%Организация%-%ВидЗапасов%-%НомерГТД%. Обратитесь к разработчикам программы.'");
		Иначе
			ТекстИсключения = НСтр("ru = 'Ошибка в алгоритмах записи %Регистратор% в регистр %Регистр%: не классифицированная ошибка по измерениям %АналитикаНоменклатуры%-%Организация%-%ВидЗапасов%-%НомерГТД%'");
		КонецЕсли;

		ТекстИсключения = СтрЗаменить(ТекстИсключения, "%Регистр%", "РезервыТоваровОрганизаций");
		ТекстИсключения = СтрЗаменить(ТекстИсключения, "%ТипЗапасов%", "ТоварНаХраненииСПравомПродажи");
		
		ЗапасыСервер.ЗаполнитьОбщиеПараметрыТекстеСообщенияОбОшибкахПроведенияПоТоварамОрганизацийИРезервам(
																				ТекстИсключения,
																				Отбор.Регистратор.Значение,
																				ВыборкаОшибок);
		
		МассивТекстовИсключений.Добавить(ТекстИсключения);
		
	КонецЦикла;
	
	ВыборкаПоРезервам = Результат[4].Выбрать();
	
	ТекущийРезерв = Новый Структура("АналитикаУчетаНоменклатуры, Организация, ВидЗапасов, НомерГТД, Период");
	НераспределенноеСторно = 0;
	
	Пока ВыборкаПоРезервам.Следующий() Цикл
		
		Если Не ОбщегоНазначенияУТКлиентСервер.СтруктурыРавны(
			ВыборкаПоРезервам, 
			ТекущийРезерв, 
			"АналитикаУчетаНоменклатуры,Организация,ВидЗапасов,НомерГТД") Тогда
			
			Если НераспределенноеСторно <> 0 Тогда
				ТекстИсключения = НСтр("ru = 'Ошибка в алгоритмах при записи %Регистратор% в регистр %Регистр%: образуется сторно, которое не нужно для покрытия резервов по изменениям: %Организация% - %АналитикаНоменклатуры% - %ВидЗапасов% - %НомерГТД%, лишнее сторно %НераспределенноеСторно%. Обратитесь к разработчикам программы.'");
				ТекстИсключения = СтрЗаменить(ТекстИсключения, "%Регистр%", "РезервыТоваровОрганизаций");
				
				ЗапасыСервер.ЗаполнитьОбщиеПараметрыТекстеСообщенияОбОшибкахПроведенияПоТоварамОрганизацийИРезервам(
					ТекстИсключения,
					Отбор.Регистратор.Значение,
					ТекущийРезерв);
				
				ТекстИсключения = СтрЗаменить(ТекстИсключения, "%НераспределенноеСторно%", НераспределенноеСторно);	
				
				МассивТекстовИсключений.Добавить(ТекстИсключения);
			КонецЕсли;
			
			ЗаполнитьЗначенияСвойств(ТекущийРезерв, ВыборкаПоРезервам);
			НераспределенноеСторно = 0;
			
		КонецЕсли;
		
		Если (НераспределенноеСторно = 0
			И ВыборкаПоРезервам.Количество < 0)
			Или НераспределенноеСторно < 0 Тогда
		
			НераспределенноеСторно = НераспределенноеСторно + ВыборкаПоРезервам.Количество;
			
			Если НераспределенноеСторно > 0 Тогда
				НераспределенноеСторно = 0;
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Если МассивТекстовИсключений.Количество() > 0 Тогда
		ВызватьИсключение СтрСоединить(МассивТекстовИсключений,Символы.ПС);
	КонецЕсли;
	
	Если ПроведениеДокументов.КонтролироватьИзменения(ДополнительныеСвойства) Тогда
		МинимальныйПериод = Результат[3].Выбрать();
		Если МинимальныйПериод.Следующий() Тогда
			МинимальныйПериод = МинимальныйПериод.Период;
		Иначе
			МинимальныйПериод = Дата('00010101');
		КонецЕсли;
		
		Выборка = Результат[2].Выбрать();
		ПроведениеДокументов.ЗарегистрироватьТаблицуКонтроля(
			ДополнительныеСвойства, "ДвиженияРезервыТоваровОрганизацийИзменение",
			Выборка.Следующий() И Выборка.Количество > 0, Новый Структура("МинимальныйПериод", МинимальныйПериод));
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
